{
  "url": "https://blackhawk.church/wp-content/uploads/2025/10/Greater-Things-Greater-Sufficiency-11.2.25.pdf",
  "questions": [
    "Have you ever changed your allegiance to a different sports team? If so, what was that change like for you?",
    "Read Colossians 2:8-10. What does it mean that “all the fullness” is in Christ? Where do you tend to feel “not enough,” and how can these verses speak into that part of your life?",
    "Read Colossians 2:11-12. What do these verses reveal about the significance of baptism?  How does becoming a follower of Christ translate to being “set apart”? How is this transformation different from self-improvement?",
    "Pastor Matt stated that when we try to add to Christ, we inevitably subtract from Christ. Have you ever been tempted to “add to Jesus” with certain religious practices, experiences, or beliefs? Why do you think that temptation exists, and what helps you refocus on Christ alone?",
    "Read Colossians 2:13-15. Pastor Matt talked about how baptism is ultimately about participating in Jesus’s death and resurrection. What does it mean to be united to Christ’s story? How does this shape your view of suffering, transformation, and spiritual growth?",
    "How does it feel to know that Jesus has nailed our sin to the cross and paid our debt in full? Why do you think we can still struggle at times to believe that all of our sin has been paid for? Is there a specific area of your life where you struggle to believe you are truly forgiven?",
    "For those who have been baptized, what was that experience like for you? For those who haven’t been baptized, if you feel comfortable, take time to share what may be holding you back."
  ],
  "sections": [
    {
      "title": "Memorization Challenge",
      "body": "Colossians 1:15-20"
    },
    {
      "title": "Pray",
      "body": "Pray that we would be filled with the knowledge of God and understanding of His will that comes from the Holy Spirit. Pray that we would grow in our hunger and desire for more of God. As we continue to reflect on this message, may we be transformed more into the image of Jesus."
    },
    {
      "title": "Next Steps",
      "body": "Check out the resources page for links to several Bible reading plans and other helpful tools. Explore other opportunities for growth and transformation by checking out courses."
    }
  ]
}