{
  "url": "https://blackhawk.church/wp-content/uploads/2025/11/Discussion-Guide-11.9.25.pdf",
  "questions": [
    "Have you ever been taken in by a phishing scheme? If so, what happened?",
    "Read Colossians 2:8-15. Why does Paul warn them to be on guard against hollow and deceptive philosophies? How is knowledge for protection in this case?",
    "Read Colossians 2:16-17. Why does Paul say that these things are “only the shadow”? How do these things point to the reality in Christ?",
    "Read Colossians 2:18-19. Paul speaks to those who have had mystical spiritual experiences. In what ways were the believers in Colossae misusing their spiritual experiences? What are the dangers of finding superiority in having spiritual experiences? What point is Paul trying to make about the connection between spiritual experiences and spiritual maturity?",
    "Why do you think it can be attractive for some people to try to follow Jesus without being committed to a local church? What are the dangers of isolating oneself or \"cutting yourself off\" from the larger Christian community?",
    "Read Colossians 2:20-23. Pastor Charles said, “when we confuse the means to maturity with maturity itself, we fall for hollow and deceptive philosophy.” What are some common spiritual practices that people can confuse with actual spiritual maturity? How can spiritual practices unintentionally lead to a dead-end?",
    "What steps or heart checks can we regularly take to ensure our spiritual practices are leading us deeper into dependence on Christ, and not merely becoming a source of personal achievement or self-righteousness? How can we support and pray for each other on the path to greater spiritual maturity?"
  ],
  "sections": [
    {
      "title": "Memorization Challenge",
      "body": "Colossians 1:15-20"
    },
    {
      "title": "Pray",
      "body": "Pray that we would be filled with the knowledge of God and understanding of His will that comes from the Holy Spirit. Pray that we would grow in our hunger and desire for more of God. As we continue to reflect on this message, pray that we would be transformed more into the image of Jesus."
    },
    {
      "title": "Next Steps",
      "body": "Check out the resources page for links to several Bible reading plans and other helpful tools. Explore other opportunities for growth and transformation by checking out courses."
    }
  ]
}