{
  "url": "https://blackhawk.church/wp-content/uploads/2025/11/HeavenNatureSing.JoytotheWorldDiscussion-Guide-11.30.25.pdf",
  "questions": [
    "When do you start listening to Christmas music? Do you have a favorite Christmas song? Read the words of Joy to the World: Joy to the world; the Lord is come; Let Earth receive her King; Let ev’ry heart prepare Him room, And heav’n and nature sing Joy to the Earth, the Savior reigns; Our mortal songs employ, White fields and floods, rocks, hills and plains, Repeat the sounding joy No more let sins and sorrows grow, Nor thorns infest the ground; He comes too make his blessings flow Far as the curse is found. He rules the world with truth and grace, And makes the nations prove The glories of his righteousness, And wonders of his love.",
    "Isaac Watts wrote the song Joy to the World as a paraphrase of the last six verses of Psalm 98. Read all of Psalm 98. What do these verses reveal about creation?",
    "Read Psalm 148:7-10 and Psalm 96: 11-12. How can we understand the concept of “universal praise” through these verses? How might our perspective shift as we realize our connectedness with all of creation as members of God’s great choir? If the mountains and trees are worshiping, what does that imply about our primary purpose?",
    "Psalm 98 and Joy to the World point to the fact that Jesus will return as the King and when that happens, Heaven and Nature will sing. Do you find it easy or difficult to sing the words of Joy to the World in your current season? How can the certainty of Christ's future reign sustain and encourage us as we long for true \"peace on earth\" in a world that often feels far from it?",
    "As we navigate this Christmas season, what are some steps we can take to keep our hearts and minds set on the true meaning of Christmas? Are there ways we can support one another in keeping Christ as the center of our lives?"
  ],
  "sections": [
    {
      "title": "Pray",
      "body": "Pray that we would be experience God’s nearness as we navigate this Christmas season. Pray that as we reflect on the hymn and Psalm 98, that we will find a deep sense of joy in the certainty of Christ’s return. As we continue to reflect on this message, pray that we would be transformed more into the image of Jesus."
    },
    {
      "title": "Next Steps",
      "body": "Check out the resources page for links to several Bible reading plans and other helpful tools. Explore other opportunities for growth and transformation by checking out courses."
    }
  ]
}