{
  "url": "https://blackhawk.church/wp-content/uploads/2025/10/Discussion-Guide-10.12.25.pdf",
  "questions": [
    "Can you pinpoint a time in your life when just getting the right information and deciding to use it made everything click? What did that breakthrough feel like?",
    "Read Colossians 1:1-14. How should knowing our new status as a children of God affect the way we live? What does it mean to live a life that is worthy of our status?",
    "Charles challenged the idea that following Jesus is about accumulating the “right answers,” and it’s about pursuing a relationship with God. How might shifting your focus from “right answers” to “knowing God” practically change the way we read scripture or approach prayer?",
    "Based on Paul’s prayer (see verses 9-14), what is the primary evidence or fruit Paul points to that should mark the life of a believer?",
    "What are the dangers or risks of mistaking intellectual knowledge about God for maturity? On the flipside, what are the risks of discounting knowledge in favor of only “feeling” or “experience”?",
    "Charles described how knowledge leads to true transformation. Have you experienced this play out in your own life? Can you think of a time in your life when a deeper understanding of God’s grace, power, or character, directly resulted in a positive change in your life? - It’s one thing to know how to grow, and another to genuinely want to. How can we practically cultivate a deeper hunger and desire for more of God? What are some ways we can support one another in growing a desire for more of God? Memorization Challenge: Colossians 1:15-20"
  ],
  "sections": [
    {
      "title": "Memorization Challenge",
      "body": "Colossians 1:15-20"
    },
    {
      "title": "Pray",
      "body": "er? - Based on Paul’s prayer (see verses 9-14), what is the primary evidence or fruit Paul points to that"
    },
    {
      "title": "Next Steps",
      "body": "Check out the resources page for links to several Bible reading plans and other helpful tools. Explore other"
    }
  ]
}