{
  "url": "https://blackhawk.church/wp-content/uploads/2026/01/Guilt-Discussion-Guide-1.11.26.pdf",
  "questions": [
    "What’s one thing you’re looking forward to life right now?",
    "Guilt says, “I did something bad.” Shame says, “I am something bad.” Why is it so important that we understand the distinction?",
    "Read Genesis 2:25 and 3:1-11. Why did Adam and Eve “feel no shame” initially? What are Adam and Eve guilty of doing? How does shame enter the story? Why do you think “hiding” is the natural reflex of a shamed heart?",
    "Read Genesis 3:12-13. Adam and Eve don’t just hide physically – they start hiding relationally and pointing to others to blame. How does shame make us “hide relationally” (i.e. getting defensive, pointing fingers, or withdrawing from friends)? In what areas of your life do you feel most pressure to “hide” or curate what people see?",
    "Read Genesis 3:21. What is the significance of this detail in the story? How can we see God’s great love in this act?",
    "Peter shared a vulnerable story about exhaustion and depression leading to shame. He noted that \"shame locks us inside by telling us we’re not allowed to talk about it.\" Why does the “voice of shame” thrive so well in silence and why is isolation so dangerous?",
    "Read 1 John 1:9. Peter invited us to consider the healing that comes through confession. Have you ever experienced healing come through confession? If you feel comfortable sharing, what was that like for you? Why do you think community is so essential to discover healing?",
    "Looking ahead, how can this group be a safe space for one another? Are there practical ways we can move towards carrying each other’s burdens?"
  ],
  "sections": [
    {
      "title": "Pray",
      "body": "Pray that we may grow in understanding how deeply loved we are by God. Pray that we may sense his invitation to come to him exactly as we are. As we continue to reflect on this message, pray that we would be transformed more into the image of Jesus."
    },
    {
      "title": "Next Steps",
      "body": "Check out the resources page for links to several Bible reading plans and other helpful tools. Explore other opportunities for growth and transformation by checking out courses."
    }
  ]
}