{
  "url": "https://blackhawk.church/wp-content/uploads/2026/01/Jealousy-Discussion-Guide-1.18.26.pdf",
  "questions": [
    "What is something—or someone—you are especially grateful for in this season of life?",
    "Read Proverbs 14:30. What does this verse teach us about the spiritual and emotional consequences of jealousy? How does jealousy affect our peace, contentment, and relationship with God?",
    "Have you ever struggled with dissatisfaction over how God created you in comparison with gifts He’s given others? How can jealousy reveal areas where we may be struggling to trust God’s wisdom and goodness?",
    "What leads to a heart of peace? Why is it important to recognize that when jealousy arises, the issue is within our own hearts—not the person we are comparing ourselves to? Are you able to identify any areas where you experience the twinge of jealousy in your own life?",
    "Read 1 Peter 5:7. What does this verse teach us about God’s care for us? Why is it important to bring even uncomfortable emotions like jealousy before Him?",
    "How can we intentionally bring feelings of jealousy before God in prayer? What biblical practices can help us replace jealousy with gratitude, humility, and trust?",
    "How does gratitude provide us with space to celebrate the achievements and success of others?",
    "What is one practical step you can take this week to guard your heart against jealousy and grow in contentment? Are there practical ways we can put the brakes on comparing ourselves with others?"
  ],
  "sections": [
    {
      "title": "Pray",
      "body": "Pray that we may grow in understanding how deeply loved we are by God. Pray that our hearts may grow to me content and at peace. Pray that we may come to God with even our uncomfortable emotions like jealousy. As we continue to reflect on this message, pray that we would be transformed more into the image of Jesus."
    },
    {
      "title": "Next Steps",
      "body": "Check out the resources page for links to several Bible reading plans and other helpful tools. Explore other opportunities for growth and transformation by checking out courses."
    }
  ]
}