{
  "url": "https://blackhawk.church/wp-content/uploads/2026/02/Discussion-Guide-2.8.26.pdf",
  "questions": [
    "Exodus was described as part of a much larger story God is telling. How do you usually approach the Bible—as individual passages or as one unfolding story? How does knowing that Exodus sits between the beginning and ending affect the way you hear its message?",
    "The sermon defined salvation as: rescue from oppression, joining a covenant community, and living in dynamic relationship with God. Which of these feels most familiar to you? Which feels most challenging or new? How is this definition broader than how salvation is often talked about?",
    "Read Exodus 1:8-16. How can we see the “us vs. them” thinking in these verses? Why did Pharaoh want to control the Hebrews and what steps does he take to do this?",
    "Pastor Charles described this as systemic evil, not just individual cruelty. What do you think that means? Where do you see “us vs. them” thinking as a natural human tendency—either in society or in yourself?",
    "Read Exodus 1:17-22. These verses reveal the depth of darkness in the world. How does this passage pave the way for the rest of the book?",
    "In a story dominated by a powerful Pharaoh, why is it significant that history forgets his name but records the names of two midwives, Shiphrah and Puah? How do these two women reveal the character of God? Can you think of a time when someone’s quiet courage or integrity made an impact on you, even if it didn’t change everything?",
    "As we go through this series, why is it important to remember that the Bible was not written to us, but for us? How can this group be a place where we can share with one another as we wrestle with hard Scripture and a complicated world?"
  ],
  "sections": [
    {
      "title": "Pray",
      "body": "Pray that we may grow in understanding how deeply loved we are by God. Pray that we may be drawn into the story of Exodus, and that we may discover more of God’s loving character on the journey. As we continue to reflect on this message, pray that we would be transformed more into the image of Jesus."
    },
    {
      "title": "Next Steps",
      "body": "Check out the resources page for links to several Bible reading plans and other helpful tools. Explore other opportunities for growth and transformation by checking out courses."
    }
  ]
}