{
  "url": "https://blackhawk.church/wp-content/uploads/2026/01/Discussion-Guide-2.1.26.pdf",
  "questions": [
    "What comes to mind when you hear the word “greed”? Why do you think it’s easier to see greed in others than in ourselves?",
    "Read Luke 12:15-19. What does the rich man believe will finally make him feel secure or at peace?",
    "Read Luke 12:20-21. What feels most sobering or unsettling about God’s response to the man? How does this passage challenge the way we define success or a “good life”?",
    "Pastor Adam said that “greed creates the illusion that we are in control.” Where do you feel the pressure to manage, secure, or control outcomes in your own life right now? What does this parable reveal about how much control we actually have?",
    "Jesus repeatedly addresses “worry” in this passage. As you reflect on your life right now, where do you notice worry showing up most? What might that worry be revealing about what matters most to you?",
    "Read Luke 12:24-28. How could slowing down and paying attention to creation help shift us from striving to trust? Why do you think God calls us to guard our hearts specifically against greed?",
    "Read Matthew 6:31-33. How does refocusing on God’s kingdom address our anxiety? What would it look like — practically and personally — to seek God’s kingdom first this week? What is one small step of trust God might be inviting you into?"
  ],
  "sections": [
    {
      "title": "Pray",
      "body": "Pray that we may grow in understanding how deeply loved we are by God. Pray that our hearts may grow to me content and at peace. Pray that we may come to God and cast all of our worries on Him. As we continue to reflect on this message, pray that we would be transformed more into the image of Jesus."
    },
    {
      "title": "Next Steps",
      "body": "Check out the resources page for links to several Bible reading plans and other helpful tools. Explore other opportunities for growth and transformation by checking out courses."
    }
  ]
}